content/post/2018-06-13-using-and-writing-completions-in-elvish.md
+++
title = "Using and writing completions in Elvish"
author = ["Diego Zamboni"]
summary = "Like other Unix shells, Elvish has advanced command-argument completion capabilities. In this article I will explore the existing completions, and show you how you can create your own (and contribute them back to the community!)"
date = 2018-06-13T20:25:00+02:00
tags = ["elvish", "shell", "completions", "unix", "config"]
draft = false
creator = "Emacs 26.2 (Org mode 9.2.3 + ox-hugo)"
toc = true
featured_image = "/images/elvish-logo.svg"
+++

Like other Unix shells, [Elvish](https://elvish.io/) has advanced command-argument completion capabilities. In this article I will explore the existing completions, and show you how you can create your own (and contribute them back to the community).


## Using existing completions {#using-existing-completions}

There is a growing body of shell completions that you can simply load and use.

Elvish has a still-small but growing collection of completions that have been created by its users. These are a few that I know of (let me know if you know others!):

-   My own [zzamboni/elvish-completions](https://github.com/zzamboni/elvish-completions) package, which contains completions for [git](https://github.com/zzamboni/elvish-completions/blob/master/git.org) (providing automatically-generated completions for all commands and their options, plus hand-crafted argument completions for many of them), [ssh](https://github.com/zzamboni/elvish-completions/blob/master/ssh.org), [vcsh](https://github.com/zzamboni/elvish-completions/blob/master/vcsh.org), [cd](https://github.com/zzamboni/elvish-completions/blob/master/cd.org), and a few of Elvish's [built-in functions and modules](https://github.com/zzamboni/elvish-completions/blob/master/builtins.org). It also contains [comp](https://github.com/zzamboni/elvish-completions/blob/master/comp.org), a framework for building completers, which we will explore in more detail below. To use any of these modules, you just need to install the elvish-completions package, and then load the modules you want. For example:

    ```elvish
    epm:install &silent-if-installed github.com/zzamboni/elvish-completions
    use github.com/zzamboni/elvish-completions/vcsh
    use github.com/zzamboni/elvish-completions/cd
    use github.com/zzamboni/elvish-completions/ssh
    use github.com/zzamboni/elvish-completions/builtins
    use github.com/zzamboni/elvish-completions/git
    ```
-   xiaq's [edit.elv/compl/go.elv](https://github.com/xiaq/edit.elv/blob/master/compl/go.elv), which provides extensive hand-crafted completions for `go`. You can also install this one as an Elvish package:

    ```elvish
    epm:install &silent-if-installed github.com/xiaq/edit.elv
    use github.com/xiaq/edit.elv/compl/go
    go:apply
    ```
-   occivink's [completers.elv](https://github.com/occivink/config/blob/master/.elvish/lib/completers.elv) file, which contains completers for `kak`, `ssh`, `systemctl`, `ffmpeg` and a few other commands.
-   Tw's [completer/](https://github.com/tw4452852/MyConfig/tree/master/config/.elvish/lib/completer) files, which contains completions for `adb`, `git` and `ssh`.
-   SolitudeSF's [completers.elv](https://github.com/SolitudeSF/dot/blob/master/elvish/lib/completers.elv) file, which contains completers for `cd`, `kak`, `kitty`, `git`, `man`, `pkill` and quite a few other commands.

As of this writing, there is no "official" collection of Elvish completions, so feel free to look at the existing ones and choose/use the ones that work best for you.

Since the collection is not yet very big, it's likely you will want to build your own completions. This is what the next section is about.


## Creating your own completions {#creating-your-own-completions}

Elvish has a simple but powerful argument-completion mechanism. You can find the full documentation [in the Elvish reference](https://elvish.io/ref/edit.html#completion-api), but let's take a quick look here.
