content/post/2018-06-13-using-and-writing-completions-in-elvish.md


### Basic (built-in) argument completion mechanisms {#basic--built-in--argument-completion-mechanisms}

Command argument completion in Elvish is implemented by functions stored inside `$edit:completion:arg-completer`. This variable is a map in which the indices are command names, and the values are functions which must receive a variable number of arguments. When the user types `cat` <kbd>Space</kbd> <kbd>Tab</kbd>, the function stored in `$edit:completion:arg-completer[cat]` (if any) is called, as follows:

```elvish
$edit:completion:arg-completer[cat] cat ''
```

The function receives the full current command line as arguments, including the current argument, which might be empty as in the example above, or be a partially typed string. For example, if the user types `cat f` <kbd>Tab</kbd>, the completer function will be called like this:

```elvish
$edit:completion:arg-completer[cat] cat 'f'
```

The completion function must use its arguments to determine the appropriate completions at that point, and return them by one of the following methods (which can be combined):

-   Output the completions to stdout, one per line;
-   Output the completions to the data stream (using `put`);
-   Output the completions using the `edit:complex-candidate` command, which can additionally specify a suffix to append to the completion in the completion menu or in the returned value, and a style to use (as accepted by `edit:styled`). The full syntax of `edit:complex-candidate` is as follows:

    ```elvish
    edit:complex-candidate &code-suffix='' &display-suffix='' &style='' $string
    ```

    `$string` is the option to display; `&code-suffix` indicates a suffix to be appended to the completion string when the user selects it; `&display-suffix` indicates a suffix to be shown in the completion menu (but which is not returned as part of the completion); and `&style` indicates a text style to use in the completion menu.

Keep in mind that the options returned by the completion function are additionally filtered by what the user has typed so far. This means that the last argument can usually be ignored, since Elvish will automatically do the filtering. An exception to this is if you want to return different _types of things_ depending on what the user has typed already. For example, if the last argument start with `-`, you may want to return the possible command-line options, and return regular argument completions otherwise.

**Example #1:** A very simple completer for the `brew` command:

```elvish
edit:completion:arg-completer[brew] = [@cmd]{
  len = (count $cmd)
  if (eq $len 2) {
    if (has-prefix $cmd[-1] -) {
      put '--version' '--verbose'
    } else {
      put install uninstall
    }
  } elif (eq $len 3) {
    brew search | eawk [l @f]{ put $@f }
  }
}
```

If the function receives two arguments, we check to see if the last argument begins with a dash. If so, we return the possible command-line options, otherwise we return the two commands `install` and `uninstall`. If we receive three arguments (i.e. we are past the initial command), we return the list of possible packages to install or uninstall.

You may noticed that there are many cases that this simple function does not handle correctly. For example, if you type `brew --verbose` <kbd>Space</kbd> <kbd>Tab</kbd>, you get the list of packages as completion, which does not make sense at that point. We will look at more complex and complete completion functions next.

The first step to more complex completions is the `edit:complete-getopt` command, which allows us to specify a sequence of positional completion functions. The general syntax of the command is:

```elvish
edit:complete-getopt $args $opts $handlers
```

Please see [its documentation](https://elvish.io/ref/edit.html#editcomplete-getopt) for a full description of the arguments.

**Example #2:** The completer for `brew` shown before can be specified like this:

```elvish
edit:completion:arg-completer[brew] = [@cmd]{
  edit:complete-getopt $cmd[1:] \
  [[&long=version] [&long=verbose]] \
  [
    [_]{ put install uninstall }
    [_]{ brew search | eawk [_ @f]{ put $@f } }
    ...
  ]
}
```

This new completer overcomes a few of the limitations in our previous attempt. For one, the `install` and `uninstall` commands are now properly completed even if you specify options before. Furthermore, the `...` at the end of the handler list indicates that the previous one (the package names) will be repeated for all further arguments - this makes it possible to complete multiple package names to install or uninstall. However, it still has some limitations! For example, it will give you all existing packages as possible arguments to `uninstall`, which only accepts already installed packages.

In addition to `complete-getopt`, Elvish includes a few other functions to help build completers:

-   `edit:complete-filename` produces a listing of all the files and directories in the directory of its argument, and is the default completion function when no other completer is specified. See its [documentation](https://elvish.io/ref/edit.html#editcomplete-filename) for full details.
-   `edit:complete-sudo` provides completions for commands like `sudo` which take a command as their first argument. It is the default completer for the `sudo` command, so that if you type `sudo` <kbd>Space</kbd> <kbd>Tab</kbd>, you get a list of all the commands on your execution path. It can be reused for other commands, for example `time`:

    ```elvish
    edit:completion:arg-completer[time] = $edit:complete-sudo~
    ```

Finally, note that if `$edit:completion:arg-completer['']` exists, it will be called as a fall-back completer if no command-specific argument completer exists. You can see that the default completer is `edit:complete-filename`, as mentioned before:

```elvish
~> put $edit:completion:arg-completer['']
▶ $edit:complete-filename~
```

With the tools you know so far, you can already create fairly complex completers. In the next section, we will explore `comp`, an external library I wrote to make it easier to specify complex completion trees.
