content/post/2018-06-13-using-and-writing-completions-in-elvish.md


### Complex completions using the `comp` framework {#complex-completions-using-the-comp-framework}

The built-in completion functions make it possible to build any completer you want. However, you might realize that for more complex cases, the specifications can be quite complex. For this reason, I wrote [the `comp` library](https://github.com/zzamboni/elvish-completions/blob/master/comp.org) as a framework to more easily specify completion functions. The basic Elvish mechanisms and functions are still used in the backend, so you can rest assured about their compatibility with the basic mechanisms.

As a first step, if you haven't done so already, you should install the `elvish-completions` package using [epm](https://elvish.io/ref/epm.html):

```elvish
use epm
epm:install github.com/zzamboni/elvish-completions
```

From the file where you will define your completions (or from your interactive session if you just want to play with it), load the `comp` module:

```elvish
use github.com/zzamboni/elvish-completions/comp
```

The main entry points for this module are `comp:item`, `comp:sequence` and `comp:subcommands`. Each one receives a single argument containing a  "completion definition", which indicates how the completions will be produced. Each one receives a different kind of completion structure, and returns a ready-to-use completion function, which can be assigned directly to an element of `$edit:completion:arg-completer`. A simple example:

```elvish
edit:completion:arg-completer[foo] = (comp:item [ bar baz ])
```

If you type this in your terminal, and then type `foo<space>` and press <kbd>Tab</kbd>, you will see the appropriate completions:

```text
> foo <Tab>
 COMPLETING argument _
 bar  baz
```

To create completions for new commands, your main task is to define the corresponding completion definition. The different types of definitions and functions are explained below, with examples of the different available structures and features.

**Note:** the main entry points return a ready-to-use argument handler function. If you ever need to expand a completion definition directly (maybe for some advanced usage), you can call `comp:-expand-item`, `comp:-expand-sequence` and `comp:-expand-subcommands`, respectively. These functions all take the definition structure and the current command line, and return the appropriate completions at that point.

We now look at the different types of completion definitions understood by `comp`.


#### Items {#items}

The base building block is the "item", can be one of the following:

-   An array containing all the potential completions (it can be empty, in which case no completions are provided). This is useful for providing a static list of completions.
-   A function which returns the potential completions (it can return nothing, in which case no completions are provided). The function should have one of the following arities, which affect which arguments will be passed to it (other arities are not valid, and in that case the item will not be executed):
    -   If it takes no arguments, no arguments are passed to it.
    -   If it takes a single argument, it gets the current (last) component of the command line `@cmd`; this is just like the handler functions understood by the `edit:complete-getopt` command.
    -   If it takes a rest argument, it gets the full current command line (the contents of `@cmd`); this is just like the functions assigned to `$edit:completion:arg-completer`.

**Example #3:** a simple completer for `cd`

In this case, we define a function which receives the current "stem" (the part of the filename the user has typed so far) and offers all the relevant files, then filters those which are directories, and returns them as completion possibilities. We pass the function directly as a completion item to `comp:-expand`.

```elvish
fn complete-dirs [arg]{ put {$arg}* | each [x]{ if (-is-dir $x) { put $x } } }
edit:completion:arg-completer[cd] = (comp:item $complete-dirs~)
```

For file and directory completion, you can use the utility function `comp:files` instead of defining your own function (see [Utility functions](#utility-functions)). `comp:files` uses `edit:complete-filename` in the backend but offers a few additional filtering options:

```elvish
edit:completion:arg-completer[cd] = (comp:item [arg]{ comp:files $arg &dirs-only })
```
