content/post/2018-06-13-using-and-writing-completions-in-elvish.md


#### Sequences and command-line options {#sequences-and-command-line-options}

Completion items can be aggregated in a _sequence of items_ and used with the `comp:sequence` function when you need to provide different completions for different positional arguments of a command, including support for command-line options at the beginning of the command (`comp:sequence` uses `edit:complete-getopt` in the backend, but provides a few additional convenient features). The definition structure in this case has to be an array of items, which will be applied depending on their position within the command parameter sequence. If the the last element of the list is the string `...` (three periods), the next-to-last element of the list is repeated for all later arguments. If no completions should be provided past the last argument, simply omit the periods. If a sequence should produce no completions at all, you can use an empty list `[]`. If any specific elements of the sequence should have no completions, you can specify `{ comp:empty }` or `[]` as its value.

If the `&opts` option is passed to the `comp:sequence` function, it must contain a single definition item which produces a list of command-line options that are allowed at the beginning of the command, when no other arguments have been provided. Options can be specified in either of the following formats:

-   As a string which gets converted to a long-style option; e.g. `all` to specify the `--all` option. The string must not contain the dashes at the beginning.
-   As a map in the style of `complete-getopt`, which may contain the following keys:
    -   `short` for the short one-letter option;
    -   `long` for the long-option string;
    -   `desc` for a descriptive string which gets shown in the completion menu;
    -   `arg-mandatory` or `arg-optional`: either one but not both can be set to `$true` to indicate whether the option takes a mandatory or optional argument;
    -   `arg-completer` can be specified to produce completions for the option argument. If specified, it must contain completion item as described in [Items](#items), and which will be expanded to provide completions for that argument's values.

Simple example of a completion data structure for option `-t` (long form `--type`), which has a mandatory argument which can be `elv`, `org` or `txt`:

```text
[ &short=t
  &long=type
  &desc="Type of file to show"
  &arg-mandatory=$true
  &arg-completer= [ elv org txt ]
]
```

**Note:** options are only offered as completions when the use has typed a dash as the first character. Otherwise the argument completers are used.

**Example #4:** we can improve on the previous completer for `cd` by preventing more than one argument from being completed (only the first argument will be completed using `complete-dirs`, since the list does not end with `...`):

```elvish
edit:completion:arg-completer[cd] = (comp:sequence [ [arg]{ comp:files $arg &dirs-only }])
```

**Example #5:** a simple completer for `ls` with a subset of its options. Note that `-l` and `-R` are only provided as completions when you have not typed any filenames yet. Also note that we are using [comp:files](#utility-functions) to provide the file completions, and the `...` at the end of the sequence to use the same completer for all further elements.

```elvish
ls-opts = [
  [ &short=l                 &desc='use a long listing format' ]
  [ &short=R &long=recursive &desc='list subdirectories recursively' ]
]
edit:completion:arg-completer[ls] = (comp:sequence &opts=$ls-opts [ $comp:files~ ... ])
```

**Example #6:** See the [ssh completer](https://github.com/zzamboni/elvish-completions/blob/master/ssh.org) for a real-world example of using sequences.
