content/post/2018-06-13-using-and-writing-completions-in-elvish.md


#### Subcommands {#subcommands}

Finally, completion sequences can be aggregated into _subcommand structures_ using the `comp:subcommands` function, to provide completion for commands such as `git`, which accept multiple subcommands, each with their own options and completions. In this case, the definition is a map indexed by subcommand names. The value of each element can be a `comp:item`,  a `comp:sequence` or another `comp:subcommands` (to provide completion for sub-sub-commands, see the example below for `vagrant`). The `comp:subcommands` function can also receive the `&opts` option to generate any available top-level options.

**Example #7:** let us reimplement our completer for the `brew` package manager, but now with support for the `install`, `uninstall` and `cat` commands. `install` and `cat` gets as completions all available packages (the output of the `brew search` command), while `uninstall` only completes installed packages (the output of `brew list`). Note that for `install` and `uninstall` we automatically extract command-line options from their help messages using the `comp:extract-opts` function (wrapped into the `-brew-opts` function), and pass them as the `&opts` option in the corresponding sequence functions. Also note that all `&opts` elements get initialized at definition time (they are arrays), whereas the sequence completions get evaluated at runtime (they are lambdas), to automatically update according to the current packages. The `cat` command sequence allows only one option. The load-time initialization of the options incurs a small delay, and you could replace these with lambdas as well so that the options are computed at runtime. Note also the usage of the `comp:decorate` function to colorize the package names in different colors for each command.

```elvish
fn -brew-opts [cmd]{
  brew $cmd -h | take 1 | \
  comp:extract-opts &regex='--(\w[\w-]*)' &regex-map=[&long= 1]
}
brew-completions = [
  &install= (comp:sequence &opts= [ (-brew-opts install) ] \
    [ { brew search | comp:decorate &style=green } ... ]
  )
  &uninstall= (comp:sequence &opts= [ (-brew-opts uninstall) ] \
    [ { brew list | comp:decorate &style=red }   ... ]
  )
  &cat= (comp:sequence [{ brew search | comp:decorate &style=blue }])
]
edit:completion:arg-completer[brew] = (comp:subcommands \
  &opts= [ version verbose ] $brew-completions
)
```

Note that in contrast to our previous `brew` completer, this definition is much more expressive, accurate, and much easier to extend.

**Example #8:** a simple completer for a subset of `vagrant`, which receives commands which may have subcommands and options of their own. Note that the value of `&up` is a `comp:sequence`, but the value of `&box` is another `comp:subcommands` which includes the completions for `box add` and `box remove`. Also note the use of the `comp:extract-opts` function to extract the command-line arguments automatically from the help messages. The output of the `vagrant` help messages matches the default format expected by `comp:extract-opts`, so we don't even have to specify a regular expression like for `brew`.

**Tip:** note that the values of `&opts` are functions (e.g. `{ vagrant-up -h | comp:extract-opts }`) instead of arrays (e.g. `( vagrant up -h | comp:extract-opts )`). As mentioned in the previous example, both are valid, but in the latter case they are all initialized at load time (when the data structure is defined), which might introduce a delay, particularly with more command definitions. By using functions the options are only extracted at runtime when the completion is requested. For further optimization, `vagrant-opts` could be made to memoize the values so that the delay only occurs the first time.

```elvish
vagrant-completions = [
  &up= (comp:sequence [] \
    &opts= { vagrant up -h | comp:extract-opts }
  )
  &box= (comp:subcommands [
      &add= (comp:sequence [] \
        &opts= { vagrant box add -h | comp:extract-opts }
      )
      &remove= (comp:sequence [ { \
            vagrant box list | eawk [_ @f]{ put $f[0] } \
        } ... ] \
        &opts= { vagrant box remove -h | comp:extract-opts }
      )
])]

edit:completion:arg-completer[vagrant] = (comp:subcommands \
  &opts= [ version help ] $vagrant-completions
)
```

**Example #9:** See the [git completer](https://github.com/zzamboni/elvish-completions/blob/master/git.org) for a real-world subcommand completion example, which also shows how extensively auto-population of subcommands and options can be done by extracting information from help messages.


#### Utility functions {#utility-functions}

The `comp` module includes a few utility functions, some of which you have seen already in the examples.

`comp:decorate` maps its input through `edit:complex-candidate` with the given options. Can be passed the same options as [edit:complex-candidate](https://elvish.io/ref/edit.html#argument-completer). In addition, if `&suffix` is specified, it is used to set both `&display-suffix` and `&code-suffix`. Input can be given either as arguments or through the pipeline:

```elvish
> comp:decorate &suffix=":" foo bar
▶ (edit:complex-candidate foo &code-suffix=: &display-suffix=: &style='')
▶ (edit:complex-candidate bar &code-suffix=: &display-suffix=: &style='')
> put foo bar | comp:decorate &style="red"
▶ (edit:complex-candidate foo &code-suffix='' &display-suffix='' &style=31)
▶ (edit:complex-candidate bar &code-suffix='' &display-suffix='' &style=31)
```

`comp:extract-opts` takes input from the pipeline and extracts command-line option data structures from its output. By default it understand the following common formats:

```text
-o, --option                Option description
-p, --print[=<what>]        Option with an optional argument
    --select <type>         Option with a mandatory argument
```

Typical use would be to populate an `&opts` element with something like this:

```elvish
comp:sequence &opts= { vagrant -h | comp:extract-opts } [ ... ]
```

The regular expression used to extract the options can be specified with the `&regex` option. Its default value (which parses the common formats shown above) is:

```elvish
&regex='^\s*(?:-(\w),?\s*)?(?:--?([\w-]+))?(?:\[=(\S+)\]|[ =](\S+))?\s*?\s\s(\w.*)$'
```

The mapping of capture groups from the regex to option components is defined by the `&regex-map` option. Its default value (which also shows the available fields) is:

```elvish
&regex-map=[&short=1 &long=2 &arg-optional=3 &arg-mandatory=4 &desc=5]
```

At least one of `short` or `long` must be present in `regex-map`. The `arg-optional` and `arg-mandatory` groups, if present, are handled specially: if any of them is not empty, then its contents is stored as `arg-desc` in the output, and the corresponding `arg-mandatory` / `arg-optional` is set to `$true`.

If `&fold` is `$true`, then the input is preprocessed to join option descriptions which span more than one line (the heuristic is not perfect and may not work in all cases, also for now it only joins one line after the option).


## Contributing your completions {#contributing-your-completions}

So you have created a brand-new completion function and would like to share it with the Elvish community. Nothing could be easier! You have two main options:

-   Publish them on your own. For example, if you put your `.elv` files into their own repository in GitHub or Gitlab, they are ready to be installed and used using [epm](https://elvish.io/ref/epm.html).
-   Contribute it to an existing repository (for example [elvish-completions](https://github.com/zzamboni/elvish-completions)). Just add your files, submit a pull request, and you are done.

I hope you have found this tutorial useful. Please let me know in the comments if you have any questions, feedback or if you find something that is incorrect.

Now, go have fun with Elvish!
